Revit 2027 API
Floor.GetSlabShapeEditor Method
 Gets a SlabShapeEditor that can be used to add or modify points of this Floor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SlabShapeEditor GetSlabShapeEditor()
Public Function GetSlabShapeEditor As SlabShapeEditor
public:
SlabShapeEditor^ GetSlabShapeEditor()
member GetSlabShapeEditor : unit -> SlabShapeEditor
Return Value
SlabShapeEditor
 The SlabShapeEditor object
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace